_posts/2015-07-06-external-dependencies.html
---
published: true
comments: yes
layout: post
title: External dependencies in odoo
tags: []
category: [odoo, development]
---

<p>
There is some non-obvious issue with external dependency in modules,
which I want to say.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Case</h2>
<div class="outline-text-2" id="text-1">

<p>Let you need to use some python lib, which is not available in system
by default and should be installed manually.
</p>
<p>
So you just make import:
</p>


{% highlight python %}
from pandas import DataFrame
{% endhighlight %}

<p>
And maybe you mention required dependence in module's
description. Very simple, right? But&hellip;
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Issue</h2>
<div class="outline-text-2" id="text-2">

<p>The case could crash odoo completely.
</p>
<p>
This is scenario when it could happen:
</p>
<ul>
<li>User is not going to use your module with external dependency, but
   your module available in Local Modules. E.g. if have a lot of
   modules in your git repository and user just makes <code>git clone</code> and
   add path to repo to <code>addons-path</code>.
</li>
<li>User's system doesn't have required dependency
</li>
<li>Your module has <code>static/</code> folder, e.g. to place icon.png file.
</li>
</ul>


<p>
Then right after restarting server, user would get error:
{% highlight python %}
2015-07-05 04:57:15,078 5760 ERROR ? werkzeug: Error on request:
Traceback (most recent call last):
  File "/usr/share/pyshared/werkzeug/serving.py", line 159, in run_wsgi
    execute(app)
  File "/usr/share/pyshared/werkzeug/serving.py", line 146, in execute
    application_iter = app(environ, start_response)
  File "/mnt/files/src/odoo/openerp/service/server.py", line 281, in app
    return self.app(e, s)
  File "/mnt/files/src/odoo/openerp/service/wsgi_server.py", line 216, in application
    return application_unproxied(environ, start_response)
  File "/mnt/files/src/odoo/openerp/service/wsgi_server.py", line 202, in application_unproxied
    result = handler(environ, start_response)
  File "/mnt/files/src/odoo/openerp/http.py", line 1244, in __call__
    self.load_addons()
  File "/mnt/files/src/odoo/openerp/http.py", line 1263, in load_addons
    m = __import__('openerp.addons.' + module)
  File "/mnt/files/src/odoo/openerp/modules/module.py", line 77, in load_module
    mod = imp.load_module('openerp.addons.' + module_part, f, path, descr)
  File "/mnt/files/git/addons-yelizariev/import_custom/__init__.py", line 1, in <module>
    import wizard
  File "/mnt/files/git/addons-yelizariev/import_custom/wizard/__init__.py", line 1, in <module>
    import upload
  File "/mnt/files/git/addons-yelizariev/import_custom/wizard/upload.py", line 14, in <module>
    from pandas import DataFrame
ImportError: No module named pandas
{% endhighlight %}

</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Suggestion</h2>
<div class="outline-text-2" id="text-3">


<p>
Whenever you use external dependency, put your import code in try block
</p>


{% highlight python %}
try:
    from pandas import DataFrame
except ImportError:
    pass
{% endhighlight %}

<p>
and add <code>external_dependencies</code> to module's manifest:
</p>


{% highlight python %}
"external_dependencies": {
    'python': ['pandas']
},
{% endhighlight %}

<p>
It will check dependencies before installing and will not raise
ImportError if user doesn't use module.
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">links</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li><a href="https://github.com/odoo/odoo/issues/7507">issue #7507</a>
</li>
</ul>

</div>
</div>
